import React from 'react'

export default function Disclaimer() {
    return (
        <div>
            <p>
                "הסכמה מדעת" להשתתפות בתהלילך הנחיה מנטלי-דיגיטלי (ההנחיה מנוסחת בלשון זכר מטעמי נוחות בלבד אך מיועדת לשני המינים):
                מוצע לך להצטרף בהתנדבות להתנסות בהנחיה מנטלית באמצעים דיגיטלים המשלבת עבודה עם דימיון מודרך, חושים והתת מודע. המערכת שמאחורי ההנחיה הינה חלק ממיזם טכנולוגי בתחום הפרה-רפואי שמטרתו הקלה על אנשים הסובלים מאלרגיות שונות וכל זאת ללא מתן תרופות, או כל התערבות חיצונית או פולשנית אחרת.
                ההנחיה שתעבור מבוססת על שיטות טיפול פרונטליות מקובלות ומוכרות, שאינן מזיקות וזאת במטרה לקבל ודאות וחיזוק לגבי היעילות הפוטנציאלית של המערכת הדיגיטלית שתפותח על בסיסה בהמשך.
                השתתפותך בתהליך נעשית מרצונך החופשי וזכותך לבחור שלא להשתתף בו ו/או לפרוש ממנו בכל זמן, מבלי לתת סיבה. למיטב ידיעתנו, כיזמים העומדים מאחורי המיזם, אין בתהליך שתעבור כל סיכונים הצפויים כתוצאה מהשתתפות בו.
                לצורך אישורך שאתה מעוניין להשתתף בתהליך, תתבקש ללחוץ על הכפתור "אני מאשר" בסוף חלק זה.
                היתרונות הצפויים לך כמשתתף, או לאחרים במצבך, כתוצאה מהניסוי הינם הפחתה מיידית ומשמעותית של הרגישות האלרגית שלך שעשויה להימשך זמן רב (חודשים ואף שנים).
                ההשתתפות במחקר הינה ללא עלות.
                השימוש בנתונים יהיה לצורכי מחקר זה בלבד.
                בכל בעיה הקשורה להנחיה ולתהליך שתעבור תוכל לפנות ל___________, בכל שעות היממה בטלפון שמספרו:___________.
                במסגרת התהליך, תתבקש לענות על שאלון. אתה יכול לבחור לא לענות על כל השאלות בשאלון או על חלק מהן.
                תוצאות הניסוי עשויות להיות בעלות ערך, ויכולות לשמש כחלק מפטנט, או פיתוח טיפולי טכנולוגי, וכד'. למשתתפים בתהליך אין זכויות ביחס לפטנטים, תרופות או תכשירים שיפותחו כתוצאה מההשתתפות בו.
                בשאלון אותו מילאת/תמלא נאסף מידע רפואי ואישי כחלק מהתהליך. מידע זה נשמר ברשומה רפואית ובאחריות צוות המיזם לשמור על סודיות רפואית. זכותך לקבל מידע מהרשומה הרפואית. אם ידוע לך שהמידע ברשומה הרפואית שגוי או חלקי עליך ליידע את הצוות
                הסכמתך להשתתף בתהליך הינה הסכמה גם לכך שמידע סטטיסטי הנאסף במהלכו יועבר במידת הצורך לגורם חיצוני. המידע יועבר לגורם החיצוני רק כשהוא מקודד ולא יכלול את פרטיך האישיים. עדויות מוקלטות ו/או מצולמות שתמסור לאחר סיום התהליך ישמרו במאגר המידע של המיזם ויתכן ויוצגו לגורמים מקצועיים, רפואיים ו/או עסקיים לפי שיקול דעת היזמים בהינתן שכל זאת נעשה לצורך קידום המיזם בלבד.
                ככלל, מידע מקודד נחשב מידע הניתן לזיהוי. הקשר בין הקוד והפרטים המזהים שלך ישמר אצל היזמים בישראל בצורה מאובטחת. במקרים מסוימים תתאפשר פתיחת הקוד על ידי היזמים
                פרטים מזהים שלך לא יופיעו באף פרסום מדעי או אחר.
                תיעוד הסכמה: בחתימתי אני מצהיר כי קראתי את התוכן של מסמך זה, הוסבר לי על התהליך ואני מסכים להשתתף בו _______________.
                ברור וידוע לי כי אין היזמים רופאים וכי כל מידע והנחיה שתסופק בתהליך אינה מהווה תחליף לטיפול רפואי או המלצה להפסקת או שינוי טיפול רפואי.
                אני מסכימ/ה לכתוב לעיל ומצהיר/ה בזאת שאני מוותר/ת על הזכות לתבוע בעתיד את המיזם והיזמים העומדים מאחורי התהליך
            </p>
        </div>
    )
}
