import React from 'react';
import { useNavigate } from 'react-router-dom';
export default function LogIn() {
  const nav = useNavigate();

  const logIn = () => {
    const password = document.getElementById('password').value;

    fetch(`http://3.126.91.66:3000/GetUserData?password=${password}`, {
      headers: { 'Accept': 'application/json', 'Content-Type': 'application/json' },
      method: 'get',
    })
      .then((response) => response.json())
      .then((data) => {
        nav('/allergyinfo', { state: { user: data.user } });
      })
      .catch((err) => {
        console.log(err);
      });
  };

  return (
    <div>
      <h1>ברוכים הבאים</h1>
      <p>מיד נתחיל בתהליך הנחיה של דמיון מודרך שייעודו הוא הפחתת להשפיע על התגובה האלרגית שאת/ה חווהלך.
        לתשומת ליבך- כדי לנקוט משנה זהירות נוכל להיכנס לתהליך עבור אלרגיות שקיבלו את אישורך המפורש שהן אינן מוגדרות כמסכנות חיים עבורך.
        במהלך ההנחיהתהליך נשתמש בדמיון מודרך כדי זה נשנה לשנות יחד את ההתניות של הפנימיות של התודעה (והתת מודע) שלך ושל מערכת החיסון שלך במטרה להקל, או להעלים את התגובה האלרגית תוך זמן קצר, וע"י כך לשפר משמעותית את איכות חייך. במהלך התהליך תהיה הנחיה ונחה באמצעות קבצי קולית וויזואלית שיפעלו ברצף וכל שעליך לעשות הוא להיכנס לתהליך במקום ובזמן שנוחים לך. בנקודות מסוימות בתהליך תתבקשיהיה צורך לתת חיווי למערכת על מנת להמשיך בתהליךבו בצורה מייטבית המתאימה רק לך. החיווי יכול להתבצע קולית ע"י אמירת YES/ NO או ע"י לחיצה על כפתורי YES/ NO שיופיעו על המסך. במהלך התהליך תתבקש/י להתחבר לתחושת גוף וזיכרונות שונים, ככל שהחיבור יהיה חזק ואוטנטי יותר, כך גם יגברו סיכויי ההצלחה.
        התהליך אורך כ- -30-40 דקות ורצוי ויש לעבור אותו בסביבה המאפשרת נוחות ושקט ללא הפרעות והסחות דעת מתחילתו ועד סופו. הרצף הינו תנאי הכרחי להצלחה.
        מומלץ מאוד להאזין לתהליך להנחיה עם אוזניות, אך אין זה הכרחי.
      </p>
      <input id="password" type="text" placeholder="הכנס סיסמא זמנית" /><br />
      <button onClick={() => logIn()}>היכנס</button>
    </div>
  );
}
