import React from 'react'

export default function Finish() {
    return (
        <div>
            <p>
                זהו, סיימת את התהליך, עכשיו נותר לבדוק את יעילותו...
                כדי לבחון את יעילות הטיפול כל שעליך לעשות הוא להיפגש ביומיים הקרובים עם "מחולל האלרגיה" בו התמקד התהליך ולשלוח לנו משוב דרך לינק שישלח אליך ביומיים הקרובים.
                יש לנקוט אמצעי זהירות ובכל מקרה להגיע עם התרופות המתאימות למפגש עם "מחולל האלרגיה" למקרה שהשפעת התהליך עדין לא תהיה מספקת.

                בהצלחה.

                בלחיצה על הכפתור למטה אני מאשר/ת שהאלרגיה בה התמקד התהליך אינה מסכנת חיים.
                אני מאשר/ת
            </p>
        </div>
    )
}
